fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ВКМ_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)

	СформироватьДвиженияПоОкладу();

КонецПроцедуры

Процедура СформироватьДвиженияПоОкладу()
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	СтрокиОклада = Начисления.НайтиСтроки(Отбор);
	
	Если СтрокиОклада.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МинДатаНачала = СтрокиОклада[0].ДатаНачала;
	МахДатаОкончания = СтрокиОклада[0].ДатаОкончания;
	
	Для Сч = 0 По СтрокиОклада.Количество() - 1 Цикл
		
		Если МинДатаНачала > СтрокиОклада[Сч].ДатаНачала Тогда
			МинДатаНачала = СтрокиОклада[Сч].ДатаНачала;
		КонецЕсли;
		 
		Если МахДатаОкончания < СтрокиОклада[Сч].ДатаОкончания Тогда
			МахДатаОкончания = СтрокиОклада[Сч].ДатаОкончания;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_НачислениеЗарплатыНачисления.Сотрудник,
	|	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала,
	|	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания,
	|	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета
	|ПОМЕСТИТЬ ВТ_периодыОкладаИсходные
	|ИЗ
	|	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
	|ГДЕ
	|	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка
	|	И ВКМ_НачислениеЗарплатыНачисления.ВидРасчета = &Оклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад
	|ПОМЕСТИТЬ ВТ_ИзменениеОклада
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатаНачала.Сотрудник,
	|	ДатаНачала.Период КАК ДатаНачала,
	|	ДатаНачала.Оклад,
	|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ДатаОкончания.Период, СЕКУНДА, -1), ДАТАВРЕМЯ(3999, 12, 31)) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ИнтервалОклады
	|ИЗ
	|	ВТ_ИзменениеОклада КАК ДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзменениеОклада КАК ДатаОкончания
	|		ПО ДатаНачала.Сотрудник = ДатаОкончания.Сотрудник
	|		И ДатаНачала.Период = ДатаОкончания.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_периодыОкладаИсходные.Сотрудник,
	|	ВТ_периодыОкладаИсходные.ВидРасчета,
	|	ВТ_ИнтервалОклады.Оклад КАК Показатель,
	|	ВЫБОР
	|		КОГДА ВТ_ИнтервалОклады.ДатаНачала > ВТ_ПериодыОкладаИсходные.ДатаНачала
	|			ТОГДА ВТ_ИнтервалОклады.ДатаНачала
	|		ИНАЧЕ ВТ_ПериодыОкладаИсходные.ДатаНачала
	|	КОНЕЦ КАК ПериодДействияНачало,
	|	ВЫБОР
	|		КОГДА ВТ_ИнтервалОклады.ДатаОкончания < ВТ_ПериодыОкладаИсходные.ДатаОкончания
	|			ТОГДА ВТ_ИнтервалОклады.ДатаОкончания
	|		ИНАЧЕ ВТ_ПериодыОкладаИсходные.ДатаОкончания
	|	КОНЕЦ КАК ПериодДействияКонец
	|ИЗ
	|	ВТ_периодыОкладаИсходные КАК ВТ_периодыОкладаИсходные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнтервалОклады КАК ВТ_ИнтервалОклады
	|		ПО ВТ_периодыОкладаИсходные.Сотрудник = ВТ_ИнтервалОклады.Сотрудник
	|		И ВТ_ИнтервалОклады.ДатаНачала <= ВТ_периодыОкладаИсходные.ДатаОкончания
	|		И ВТ_периодыОкладаИсходные.ДатаНачала <= ВТ_ИнтервалОклады.ДатаОкончания";
	
	Для Каждого Строка из Начисления Цикл
		// регистр ВКМ_ОсновныеНачисления
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = Строка.ВидРасчета;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = Строка.ДатаНачала;
		Движение.ПериодДействияКонец = Строка.ДатаОкончания;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Размер = ВКМ_ДанныеСотрудников.ПолучитьОкладСотрудника(Строка.Сотрудник);
		
		// регистр ВКМ_Удержания
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
	КонецЦикла;

Движения.ВКМ_ОсновныеНачисления.Записать();
Движения.ВКМ_Удержания.Записать();

КонецПроцедуры
